import pandas as pd
file_path = 'full_data_with_progresive_statistics.xlsx'
df = pd.read_excel(file_path)
# Так как эта штука потом везде будет фигурировать,я забубенил ее в отдельнуюю переменную,чтобы попроще вызывать
minutes_column = 'Минут на поле в розыгрыше'
#Крутость игрока в пересчете на сыгранные минуты
df['Коэффициент голов за минуту'] = df['Голы'] / df[minutes_column]
df['Коэффициент голевых передач за минуту'] = df['Голевые пасы'] / df[minutes_column]
df['Коэффициент голов + голевых передач за минуту'] = df['Голы+голевые пасы'] / df[minutes_column]
df['Коэффициент прогрессивных переносов за минуту'] = df['Прогресивный перенос'] / df[minutes_column]
df['Коэффициент прогрессивных пасов за минуту'] = df['Прогрессивный пас'] / df[minutes_column]
df['Коэффициент неудачных прогрессивных пасов за минуту'] = df['Прогресивные пасы не дошедшие до получателя'] / df[minutes_column]
df['Успешные прогрессивные пасы'] = df['Прогрессивный пас'] - df['Прогресивные пасы не дошедшие до получателя']
df['Коэффициент успешных прогрессивных пасов'] = df['Успешные прогрессивные пасы'] / df['Прогрессивный пас']
df.to_excel('updated_with_new_statistics_full_data_with_progresive_statistics.xlsx')
